import {проверка_моделей,  Символ, Не, И, Или, Импликация, Эквивалентность} from './logic.mjs'


let АРыцарь = new Символ("А - рыцарь.")
let АЛжец = new Символ("А - лжец.")

let БРыцарь = new Символ("Б - рыцарь.")
let БЛжец = new Символ("Б - лжец.")

let ВРыцарь = new Символ("В - рыцарь.")
let ВЛжец = new Символ("В - лжец.")

// Задача 0
// А сказал: "Я и лжец и рыцарь."
let знания0 = new И(
	new Или(АРыцарь,АЛжец),
	new Не(АРыцарь))
// Добавьте

// Задача 1
// А сказал: "Мы оба лжецы."
// Б ни чего не сказал.
let знания1 = new И(
	new Или(АЛжец,БЛжец),
	new Или(АЛжец,АРыцарь),
	new Или(БЛжец,БРыцарь),
	new Импликация(new Не(АРыцарь),БРыцарь),
	new Не(АРыцарь))
    // Добавьте

// Задача 2
// А сказал: "Мы одинаковые."
// Б сказал: "Мы разного вида."
let знания2 = new И(
	new Или(АРыцарь,БРыцарь),
	new Или(АЛжец,БЛжец),
	new Или(АЛжец,БРыцарь),
	new Или(АРыцарь,БЛжец),
	new Импликация(БРыцарь,АЛжец),
	new Импликация(АЛжец,БРыцарь))
    // Добавьте

// Задача 3
// А сказал, но мы вы не услышали.
// Б сказал: "А сказал 'Я лжец'."
// Б сказал: "В - лжец."
// В сказал: "А - рыцарь."
let знания3 = new И(
	new Или(АРыцарь,АЛжец),
	new Или(БРыцарь,БЛжец),
	new Или(ВРыцарь,ВЛжец),
	new И(АРыцарь,ВРыцарь),
	new Импликация(АРыцарь,БЛжец),
	new Импликация(БЛжец,ВРыцарь),
	new Импликация(БЛжец,АРыцарь))
    // Добавьте


let символы = [АРыцарь, АЛжец, БРыцарь, БЛжец, ВРыцарь, ВЛжец]
let задания = {
        "Задание 0": знания0,
        "Задание 1": знания1,
        "Задание 2": знания2,
        "Задание 3": знания3
    }

main()


function main()
{
	for(let задание in задания)
	{
		console.log(задание)
		if(задания[задание].операнды.length == 0)
		    console.log("    Пока не реализована.")
		else
		    for(let  символ of символы)
			if(проверка_моделей(задания[задание], символ))
			    console.log(`    ${символ.имя}`)
	}
}

